Tekla Open API Reference for Tekla Structures 2025
CrossSection.Profile Property
 The profile where cross section is asked from
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ProfileName Profile { get; set; }
Public Property Profile As ProfileName
	Get
	Set
Property Value
Type: ProfileName
See Also
Reference
CrossSection Class
Tekla.Structures.Catalogs Namespace